#pragma region 相关头文件
#include <iostream>
#include <stdio.h>
#include <windows.h>
#include <time.h>
#include <gl/glut.h>
#pragma endregion

using namespace std;
HWND hWnd;

#pragma region 函数声明
void Init();
void DrawInfo();
void DrawSquare(GLint x,GLint y);
void DrawCurrentTetris(int x,int y);
void DrawNextTetris(int x,int y);
void DrawTetris(int x,int y);
bool TetrisCanMove(int direction);
void TetrisMovement_Down();
void TetrisMovement_Left();
void TetrisMovement_Right();
void TetrisRotate();
void CALLBACK TimerProc(HWND hwnd,UINT uMsg,UINT_PTR idEvent,DWORD dwTime);
void LayerCut();
void Draw();
void KeyboardFunc(GLint SpecialKey,GLint Mouse_X,GLint Mouse_Y);
void GameDisplay();
void GameOver();
void WindowReshape(GLint newWidth,GLint newHeight);
#pragma endregion

#pragma region 窗口信息设定
GLint Window_Width = 700,Window_Height = 750;//窗口大小
GLint WindowPosition_X = 0,WindowPosition_Y = 0;//窗口左下角坐标
const int View_Width = 240,View_Height = 600;//方块区域大小(30*12格)
#pragma endregion

#pragma region 方块参数定义
struct Tetris{
	int InitCurrent_j;//当前方块初始化时最左下格子 行值
	int InitCurrent_i;//当前方块初始化时最左下格子 列值
	int InitCurrent_x;//当前方块初始化时最左下格子 左下角坐标
	int InitCurrent_y;//当前方块初始化时最左下格子 左下角坐标

	int Current_Number;//当前方块 编号
	int Next_Number;//下一方块 编号
	int Current_Form;//当前方块 形状

	int Current_j;//当前方块最左下格子 行值
	int Current_i;//当前方块最左下格子 列值
	int Current_x;//当前方块最左下格子 左下角坐标
	int Current_y;//当前方块最左下格子 左下角坐标
};
struct Tetris Tetris;
#pragma endregion

#pragma region 全局变量设定
int Grid[33][15];//游戏区域每一格的参数，最上3行不显示，为了防止越界
bool NewTetrisNeeded = 1;//是否需要生成新方块
bool Game_Over = 0;//是否游戏失败
int Point = 0;//游戏得分
int Score = 0;//游戏总分
int Count = 0;//已出现的方块数目
int Level = 0;//游戏速度级别
int Level_Add = 0;//用F2增加的关卡数目，用于修正Point和Level的换算
int Level_Old = 0;//加分前的等级
int Speed[12] = {1000,860,730,610,500,400,310,230,160,100,50,25};//游戏速度(ms)
bool Pause = 1;//游戏是否处于暂停中
bool DeathMode = 0;//死亡模式
UINT_PTR Timer;//游戏计时器
#pragma endregion

#pragma region 方块移动的方向
#define DOWN 1
#define LEFT 2
#define RIGHT 3
#pragma endregion

#pragma region 方块参数设定
/*
共有7种形状，编号n= 0-6
每一种形状有4种形态，编号f=0-3
每个形状形态为5*6矩阵[k][l]
矩阵参数中1为形状中的方块，2/3/4为上/左/右边界，5/6为左上/右上边界
*/
int TetrisShape[7][4][5][6] = {
	{//0
		{
			{0,2,2,0,0,0},
			{3,1,1,4,0,0},
			{3,1,1,4,0,0},
			{0,0,0,0,0,0},
			{0,0,0,0,0,0}},
		{
			{0,2,2,0,0,0},
			{3,1,1,4,0,0},
			{3,1,1,4,0,0},
			{0,0,0,0,0,0},
			{0,0,0,0,0,0}},
		{
			{0,2,2,0,0,0},
			{3,1,1,4,0,0},
			{3,1,1,4,0,0},
			{0,0,0,0,0,0},
			{0,0,0,0,0,0}},
		{
			{0,2,2,0,0,0},
			{3,1,1,4,0,0},
			{3,1,1,4,0,0},
			{0,0,0,0,0,0},
			{0,0,0,0,0,0}
		}
	},

	{//1
		{
			{0,0,2,0,0,0},
			{0,5,1,4,0,0},
			{3,1,1,4,0,0},
			{3,1,0,0,0,0},
			{0,0,0,0,0,0}},
		{
			{0,2,2,0,0,0},
			{3,1,1,6,0,0},
			{0,3,1,1,4,0},
			{0,0,0,0,0,0},
			{0,0,0,0,0,0}},
		{
			{0,0,2,0,0,0},
			{0,5,1,4,0,0},
			{3,1,1,4,0,0},
			{3,1,0,0,0,0},
			{0,0,0,0,0,0}},
		{
			{0,2,2,0,0,0},
			{3,1,1,6,0,0},
			{0,3,1,1,4,0},
			{0,0,0,0,0,0},
			{0,0,0,0,0,0}
		}
	},

	{//2
		{
			{0,2,0,0,0,0},
			{3,1,6,0,0,0},
			{3,1,1,4,0,0},
			{0,0,1,4,0,0},
			{0,0,0,0,0,0}},
		{
			{0,0,2,2,0,0},
			{0,5,1,1,4,0},
			{3,1,1,4,0,0},
			{0,0,0,0,0,0},
			{0,0,0,0,0,0}},
		{
			{0,2,0,0,0,0},
			{3,1,6,0,0,0},
			{3,1,1,4,0,0},
			{0,0,1,4,0,0},
			{0,0,0,0,0,0}},
		{
			{0,0,2,2,0,0},
			{0,5,1,1,4,0},
			{3,1,1,4,0,0},
			{0,0,0,0,0,0},
			{0,0,0,0,0,0}
		}
	},

	{//3
		{
			{0,0,2,0,0,0},
			{0,3,1,4,0,0},
			{0,3,1,4,0,0},
			{0,3,1,4,0,0},
			{0,3,1,4,0,0}},
		{
			{0,2,2,2,2,0},
			{3,1,1,1,1,4},
			{0,0,0,0,0,0},
			{0,0,0,0,0,0},
			{0,0,0,0,0,0}},
		{
			{0,0,2,0,0,0},
			{0,3,1,4,0,0},
			{0,3,1,4,0,0},
			{0,3,1,4,0,0},
			{0,3,1,4,0,0}},
		{
			{0,2,2,2,2,0},
			{3,1,1,1,1,4},
			{0,0,0,0,0,0},
			{0,0,0,0,0,0},
			{0,0,0,0,0,0}
		}
	},

	{//4
		{
			{0,2,2,2,0,0},
			{3,1,1,1,4,0},
			{0,3,1,4,0,0},
			{0,0,0,0,0,0},
			{0,0,0,0,0,0}},
		{
			{0,0,2,0,0,0},
			{0,5,1,4,0,0},
			{3,1,1,4,0,0},
			{0,3,1,4,0,0},
			{0,0,0,0,0,0}},
		{
			{0,0,2,0,0,0},
			{0,5,1,6,0,0},
			{3,1,1,1,4,0},
			{0,0,0,0,0,0},
			{0,0,0,0,0,0}},
		{
			{0,2,0,0,0,0},
			{3,1,6,0,0,0},
			{3,1,1,4,0,0},
			{3,1,4,0,0,0},
			{0,0,0,0,0,0}
		}
	},

	{//5
		{
			{0,0,2,0,0,0},
			{0,3,1,4,0,0},
			{0,5,1,4,0,0},
			{3,1,1,4,0,0},
			{0,0,0,0,0,0}},
		{
			{0,2,0,0,0,0},
			{0,1,6,2,0,0},
			{3,1,1,1,4,0},
			{0,0,0,0,0,0},
			{0,0,0,0,0,0}},
		{
			{0,2,2,0,0,0},
			{3,1,1,4,0,0},
			{3,1,4,0,0,0},
			{3,1,4,0,0,0},
			{0,0,0,0,0,0}},
		{
			{0,2,2,2,0,0},
			{3,1,1,1,4,0},
			{0,0,0,1,4,0},
			{0,0,0,0,0,0},
			{0,0,0,0,0,0}
		}
	},

	{//6
		{
			{0,2,0,0,0,0},
			{3,1,4,0,0,0},
			{3,1,6,0,0,0},
			{3,1,1,4,0,0},
			{0,0,0,0,0,0}},
		{
			{0,2,2,2,0,0},
			{3,1,1,1,4,0},
			{3,1,4,0,0,0},
			{0,0,0,0,0,0},
			{0,0,0,0,0,0}},
		{
			{0,2,2,0,0,0},
			{3,1,1,4,0,0},
			{0,0,1,4,0,0},
			{0,0,1,4,0,0},
			{0,0,0,0,0,0}},
		{
			{0,0,0,2,0,0},
			{0,2,5,1,4,0},
			{3,1,1,1,4,0},
			{0,0,0,0,0,0},
			{0,0,0,0,0,0}
		}
	}
};
#pragma endregion